# 6.	Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

number_letter = int(input("Choose a letter and enter its number: "))

print(string.ascii_lowercase[number_letter -1])